99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/adc/esp32_mquickjs_adc.c
#include "esp32_mquickjs_adc.h"

#if CONFIG_ESP32_MQUICKJS_FEATURE_ADC

#include "esp32_mquickjs_adc_unit_resources.h"
#include "esp32_mquickjs_core.h"

#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "esp_adc/adc_cali.h"
#include "esp_adc/adc_cali_scheme.h"
#include "esp_adc/adc_oneshot.h"
#include "esp_err.h"
#include "soc/soc_caps.h"

typedef struct {
    bool configured;
    adc_atten_t atten;
    adc_bitwidth_t bitwidth;
    adc_cali_handle_t cali_handle;
    adc_cali_scheme_ver_t cali_scheme;
} esp32_mquickjs_adc_channel_state_t;

typedef struct {
    bool opened;
    adc_oneshot_unit_handle_t handle;
    esp32_mquickjs_adc_channel_state_t channels[SOC_ADC_MAX_CHANNEL_NUM];
} esp32_mquickjs_adc_unit_state_t;

static esp32_mquickjs_adc_unit_state_t s_adc_units[SOC_ADC_PERIPH_NUM];
static adc_cali_scheme_ver_t s_adc_cali_schemes;

typedef struct {
    const adc_oneshot_unit_init_cfg_t *config;
} adc_unit_resource_context_t;

static int adc_resource_create_unit(void *opaque, void **out_unit)
{
    adc_unit_resource_context_t *context = opaque;
    adc_oneshot_unit_handle_t handle = NULL;
    esp_err_t err;

    if (context == NULL || context->config == NULL || out_unit == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    err = adc_oneshot_new_unit(context->config, &handle);
    *out_unit = handle;
    return err;
}

static int adc_resource_delete_calibration(void *calibration, int scheme,
                                           void *opaque)
{
    (void)opaque;
#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
    if ((adc_cali_scheme_ver_t)scheme ==
        ADC_CALI_SCHEME_VER_CURVE_FITTING) {
        return adc_cali_delete_scheme_curve_fitting(
            (adc_cali_handle_t)calibration);
    }
#endif
#if ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
    if ((adc_cali_scheme_ver_t)scheme ==
        ADC_CALI_SCHEME_VER_LINE_FITTING) {
        return adc_cali_delete_scheme_line_fitting(
            (adc_cali_handle_t)calibration);
    }
#endif
    return ESP_ERR_INVALID_STATE;
}

static int adc_resource_delete_unit(void *unit, void *opaque)
{
    (void)opaque;
    return adc_oneshot_del_unit((adc_oneshot_unit_handle_t)unit);
}

static esp32_mquickjs_adc_unit_resource_ops_t adc_unit_resource_ops(
    adc_unit_resource_context_t *context)
{
    return (esp32_mquickjs_adc_unit_resource_ops_t){
        .create_unit = adc_resource_create_unit,
        .delete_calibration = adc_resource_delete_calibration,
        .delete_unit = adc_resource_delete_unit,
        .opaque = context,
    };
}

static int adc_unit_to_number(adc_unit_t unit)
{
    return (int)unit + 1;
}

static bool adc_unit_supported(adc_unit_t unit)
{
    return (int)unit >= 0 && (int)unit < SOC_ADC_PERIPH_NUM;
}

static int adc_channel_count(adc_unit_t unit)
{
    return adc_unit_supported(unit) ? SOC_ADC_CHANNEL_NUM(unit) : 0;
}

static int js_value_to_adc_unit(JSContext *ctx, JSValue value, adc_unit_t *out_unit)
{
    int raw_unit = 0;

    if (JS_ToInt32(ctx, &raw_unit, value) != 0) {
        return -1;
    }
    if (raw_unit != 1 && raw_unit != 2) {
        return -1;
    }

    *out_unit = raw_unit == 1 ? ADC_UNIT_1 : ADC_UNIT_2;
    return adc_unit_supported(*out_unit) ? 0 : -1;
}

static int js_value_to_adc_channel(JSContext *ctx,
                                   JSValue value,
                                   adc_unit_t unit,
                                   adc_channel_t *out_channel)
{
    int raw_channel = -1;

    if (JS_ToInt32(ctx, &raw_channel, value) != 0 ||
        raw_channel < 0 ||
        raw_channel >= adc_channel_count(unit)) {
        return -1;
    }

    *out_channel = (adc_channel_t)raw_channel;
    return 0;
}

static int js_value_to_adc_atten(JSContext *ctx, JSValue value, adc_atten_t *out_atten)
{
    int raw_atten = -1;

    if (JS_ToInt32(ctx, &raw_atten, value) != 0 ||
        raw_atten < ADC_ATTEN_DB_0 ||
        raw_atten > ADC_ATTEN_DB_12) {
        return -1;
    }

    *out_atten = (adc_atten_t)raw_atten;
    return 0;
}

static int js_value_to_adc_bitwidth(JSContext *ctx, JSValue value, adc_bitwidth_t *out_bitwidth)
{
    int raw_bitwidth = -1;

    if (JS_ToInt32(ctx, &raw_bitwidth, value) != 0) {
        return -1;
    }

    if (raw_bitwidth == ADC_BITWIDTH_DEFAULT ||
        raw_bitwidth == ADC_BITWIDTH_9 ||
        raw_bitwidth == ADC_BITWIDTH_10 ||
        raw_bitwidth == ADC_BITWIDTH_11 ||
        raw_bitwidth == ADC_BITWIDTH_12 ||
        raw_bitwidth == ADC_BITWIDTH_13) {
        *out_bitwidth = (adc_bitwidth_t)raw_bitwidth;
        return 0;
    }

    return -1;
}

static esp32_mquickjs_adc_unit_state_t *adc_unit_state(adc_unit_t unit)
{
    return &s_adc_units[(int)unit];
}

static esp32_mquickjs_adc_channel_state_t *adc_channel_state(adc_unit_t unit, adc_channel_t channel)
{
    return &adc_unit_state(unit)->channels[(int)channel];
}

static esp32_mquickjs_adc_unit_resources_t adc_resources_from_state(
    esp32_mquickjs_adc_unit_state_t *unit_state,
    esp32_mquickjs_adc_calibration_resource_t
        calibrations[SOC_ADC_MAX_CHANNEL_NUM])
{
    for (int i = 0; i < SOC_ADC_MAX_CHANNEL_NUM; ++i) {
        calibrations[i].handle = unit_state->channels[i].cali_handle;
        calibrations[i].scheme = (int)unit_state->channels[i].cali_scheme;
    }

    return (esp32_mquickjs_adc_unit_resources_t){
        .unit = unit_state->handle,
        .calibrations = calibrations,
        .calibration_count = SOC_ADC_MAX_CHANNEL_NUM,
    };
}

static void adc_store_resources(
    esp32_mquickjs_adc_unit_state_t *unit_state,
    const esp32_mquickjs_adc_unit_resources_t *resources)
{
    unit_state->handle = (adc_oneshot_unit_handle_t)resources->unit;
    for (int i = 0; i < SOC_ADC_MAX_CHANNEL_NUM; ++i) {
        unit_state->channels[i].cali_handle =
            (adc_cali_handle_t)resources->calibrations[i].handle;
        unit_state->channels[i].cali_scheme =
            (adc_cali_scheme_ver_t)resources->calibrations[i].scheme;
    }
}

static esp_err_t adc_release_cali_handle(
    esp32_mquickjs_adc_channel_state_t *channel_state)
{
    adc_unit_resource_context_t context = {0};
    esp32_mquickjs_adc_unit_resource_ops_t ops =
        adc_unit_resource_ops(&context);
    esp32_mquickjs_adc_calibration_resource_t calibration;
    esp32_mquickjs_adc_unit_resources_t resources;
    esp_err_t err;

    if (channel_state == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    if (channel_state->cali_handle == NULL) {
        channel_state->cali_scheme = 0;
        return ESP_OK;
    }

