99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/adc/esp32_mquickjs_adc.c
    calibration.handle = channel_state->cali_handle;
    calibration.scheme = (int)channel_state->cali_scheme;
    resources = (esp32_mquickjs_adc_unit_resources_t){
        .unit = NULL,
        .calibrations = &calibration,
        .calibration_count = 1,
    };
    err = (esp_err_t)esp32_mquickjs_adc_unit_resources_deinit(
        &resources, &ops);
    channel_state->cali_handle = (adc_cali_handle_t)calibration.handle;
    channel_state->cali_scheme =
        (adc_cali_scheme_ver_t)calibration.scheme;
    return err;
}

static void adc_reset_unit_state(adc_unit_t unit)
{
    esp32_mquickjs_adc_unit_state_t *unit_state = adc_unit_state(unit);

    memset(unit_state, 0, sizeof(*unit_state));
    for (int i = 0; i < SOC_ADC_MAX_CHANNEL_NUM; ++i) {
        unit_state->channels[i].atten = ADC_ATTEN_DB_12;
        unit_state->channels[i].bitwidth = ADC_BITWIDTH_DEFAULT;
    }
}

static esp_err_t adc_close_unit_state(adc_unit_t unit)
{
    esp32_mquickjs_adc_unit_state_t *unit_state = adc_unit_state(unit);
    adc_unit_resource_context_t context = {0};
    esp32_mquickjs_adc_unit_resource_ops_t ops =
        adc_unit_resource_ops(&context);
    esp32_mquickjs_adc_calibration_resource_t
        calibrations[SOC_ADC_MAX_CHANNEL_NUM];
    esp32_mquickjs_adc_unit_resources_t resources =
        adc_resources_from_state(unit_state, calibrations);
    esp_err_t err;

    err = (esp_err_t)esp32_mquickjs_adc_unit_resources_deinit(
        &resources, &ops);
    adc_store_resources(unit_state, &resources);
    if (err != ESP_OK) {
        return err;
    }

    adc_reset_unit_state(unit);
    return ESP_OK;
}

static JSValue adc_throw_error(JSContext *ctx,
                               esp_err_t err,
                               const char *api_name,
                               adc_unit_t unit,
                               int channel)
{
    if (channel >= 0) {
        return JS_ThrowInternalError(ctx,
                                     "%s(unit=%d, channel=%d) failed: %s",
                                     api_name,
                                     adc_unit_to_number(unit),
                                     channel,
                                     esp_err_to_name(err));
    }

    return JS_ThrowInternalError(ctx,
                                 "%s(unit=%d) failed: %s",
                                 api_name,
                                 adc_unit_to_number(unit),
                                 esp_err_to_name(err));
}

static bool adc_require_open(JSContext *ctx, adc_unit_t unit)
{
    if (!adc_unit_state(unit)->opened || adc_unit_state(unit)->handle == NULL) {
        JS_ThrowInternalError(ctx, "adc unit %d is not open; call adc.open(%d) first", adc_unit_to_number(unit), adc_unit_to_number(unit));
        return false;
    }
    return true;
}

static bool adc_require_configured(JSContext *ctx, adc_unit_t unit, adc_channel_t channel)
{
    if (!adc_channel_state(unit, channel)->configured) {
        JS_ThrowInternalError(ctx,
                              "adc channel is not configured; call adc.configure(%d, %d, ... ) first",
                              adc_unit_to_number(unit),
                              (int)channel);
        return false;
    }
    return true;
}

static void adc_create_cali_state(adc_unit_t unit,
                                  adc_channel_t channel,
                                  adc_atten_t atten,
                                  adc_bitwidth_t bitwidth)
{
    esp32_mquickjs_adc_channel_state_t *channel_state = adc_channel_state(unit, channel);
    adc_cali_handle_t handle = NULL;

#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
    if ((s_adc_cali_schemes & ADC_CALI_SCHEME_VER_CURVE_FITTING) != 0) {
        adc_cali_curve_fitting_config_t config = {
            .unit_id = unit,
            .chan = channel,
            .atten = atten,
            .bitwidth = bitwidth,
        };

        if (adc_cali_create_scheme_curve_fitting(&config, &handle) == ESP_OK) {
            channel_state->cali_handle = handle;
            channel_state->cali_scheme = ADC_CALI_SCHEME_VER_CURVE_FITTING;
            return;
        }
    }
#endif

#if ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
    if ((s_adc_cali_schemes & ADC_CALI_SCHEME_VER_LINE_FITTING) != 0) {
        adc_cali_line_fitting_config_t config = {
            .unit_id = unit,
            .atten = atten,
            .bitwidth = bitwidth,
        };

        if (adc_cali_create_scheme_line_fitting(&config, &handle) == ESP_OK) {
            channel_state->cali_handle = handle;
            channel_state->cali_scheme = ADC_CALI_SCHEME_VER_LINE_FITTING;
        }
    }
#endif
}

static JSValue adc_make_channel_object(JSContext *ctx,
                                       adc_unit_t unit,
                                       adc_channel_t channel)
{
    esp32_mquickjs_adc_channel_state_t *channel_state = adc_channel_state(unit, channel);
    JSGCRef channel_ref;
    JSValue *channel_obj;
    int pin = -1;
    bool mapped = adc_oneshot_channel_to_io(unit, channel, &pin) == ESP_OK;

    channel_obj = JS_PushGCRef(ctx, &channel_ref);
    *channel_obj = JS_NewObject(ctx);
    if (JS_IsException(*channel_obj)) {
        JS_PopGCRef(ctx, &channel_ref);
        return JS_EXCEPTION;
    }

    if (!esp32_mquickjs_set_property_ref(ctx, channel_obj, "channel", JS_NewInt32(ctx, (int32_t)channel)) ||
        !esp32_mquickjs_set_property_ref(ctx, channel_obj, "configured", JS_NewBool(channel_state->configured)) ||
        !esp32_mquickjs_set_property_ref(ctx, channel_obj, "atten",
                                     channel_state->configured
                                         ? JS_NewInt32(ctx, (int32_t)channel_state->atten)
                                         : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, channel_obj, "bitwidth",
                                     channel_state->configured
                                         ? JS_NewInt32(ctx, (int32_t)channel_state->bitwidth)
                                         : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, channel_obj, "pin",
                                     mapped ? JS_NewInt32(ctx, pin) : JS_NULL) ||
        !esp32_mquickjs_set_property_ref(ctx, channel_obj, "calibrated",
                                     JS_NewBool(channel_state->cali_handle != NULL))) {
        JS_PopGCRef(ctx, &channel_ref);
        return JS_EXCEPTION;
    }

    return JS_PopGCRef(ctx, &channel_ref);
}

static JSValue adc_make_status_object(JSContext *ctx, adc_unit_t unit)
{
    esp32_mquickjs_adc_unit_state_t *unit_state = adc_unit_state(unit);
    JSGCRef status_ref;
    JSGCRef channels_ref;
    JSValue *status_obj;
    JSValue *channels_array;

    status_obj = JS_PushGCRef(ctx, &status_ref);
    channels_array = JS_PushGCRef(ctx, &channels_ref);
    *status_obj = JS_NewObject(ctx);
    *channels_array = JS_UNDEFINED;
    if (JS_IsException(*status_obj)) {
        goto fail;
    }

