99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/adc/esp32_mquickjs_adc.c
    *channels_array = JS_NewArray(ctx, 0);
    if (JS_IsException(*channels_array)) {
        goto fail;
    }

    for (int i = 0; i < adc_channel_count(unit); ++i) {
        JSGCRef channel_ref;
        JSValue *channel_obj = JS_PushGCRef(ctx, &channel_ref);

        *channel_obj = adc_make_channel_object(ctx, unit, (adc_channel_t)i);
        if (JS_IsException(*channel_obj) ||
            JS_IsException(JS_SetPropertyUint32(ctx, *channels_array, (uint32_t)i, *channel_obj))) {
            JS_PopGCRef(ctx, &channel_ref);
            goto fail;
        }
        JS_PopGCRef(ctx, &channel_ref);
    }

    if (!esp32_mquickjs_set_property_ref(ctx, status_obj, "unit", JS_NewInt32(ctx, adc_unit_to_number(unit))) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "opened", JS_NewBool(unit_state->opened)) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "channelCount", JS_NewInt32(ctx, adc_channel_count(unit))) ||
        !esp32_mquickjs_set_property_ref(ctx, status_obj, "channels", *channels_array)) {
        goto fail;
    }

    JS_PopGCRef(ctx, &channels_ref);
    return JS_PopGCRef(ctx, &status_ref);

fail:
    JS_PopGCRef(ctx, &channels_ref);
    JS_PopGCRef(ctx, &status_ref);
    return JS_EXCEPTION;
}

void esp32_mquickjs_deinit_adc_runtime(void)
{
    for (int unit = 0; unit < SOC_ADC_PERIPH_NUM; ++unit) {
        (void)adc_close_unit_state((adc_unit_t)unit);
    }
    s_adc_cali_schemes = 0;
}

bool esp32_mquickjs_init_adc_runtime(JSContext *ctx)
{
    for (int unit = 0; unit < SOC_ADC_PERIPH_NUM; ++unit) {
        esp_err_t err = adc_close_unit_state((adc_unit_t)unit);

        if (err != ESP_OK) {
            (void)adc_throw_error(ctx,
                                  err,
                                  "adc runtime cleanup",
                                  (adc_unit_t)unit,
                                  -1);
            return false;
        }
    }
    s_adc_cali_schemes = 0;
    if (adc_cali_check_scheme(&s_adc_cali_schemes) != ESP_OK) {
        s_adc_cali_schemes = 0;
    }
    return true;
}

JSValue js_adc_open(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    adc_unit_t unit;
    adc_oneshot_unit_init_cfg_t config = {0};
    adc_unit_resource_context_t resource_context;
    esp32_mquickjs_adc_unit_resource_ops_t resource_ops;
    esp32_mquickjs_adc_calibration_resource_t
        calibrations[SOC_ADC_MAX_CHANNEL_NUM];
    esp32_mquickjs_adc_unit_resources_t resources;
    esp_err_t err;

    (void)this_val;

    if (argc < 1 || js_value_to_adc_unit(ctx, argv[0], &unit) != 0) {
        return JS_ThrowTypeError(ctx, "adc.open(unit) expects adc.UNIT_1 or adc.UNIT_2");
    }

    err = adc_close_unit_state(unit);
    if (err != ESP_OK) {
        return adc_throw_error(ctx, err, "adc.open cleanup", unit, -1);
    }

    config.unit_id = unit;
    config.clk_src = 0;
    config.ulp_mode = ADC_ULP_MODE_DISABLE;
    resource_context = (adc_unit_resource_context_t){
        .config = &config,
    };
    resource_ops = adc_unit_resource_ops(&resource_context);
    resources = adc_resources_from_state(adc_unit_state(unit), calibrations);

    err = (esp_err_t)esp32_mquickjs_adc_unit_resources_init(
        &resources, &resource_ops);
    adc_store_resources(adc_unit_state(unit), &resources);
    if (err != ESP_OK) {
        return adc_throw_error(ctx, err, "adc.open create", unit, -1);
    }

    adc_unit_state(unit)->opened = true;
    return adc_make_status_object(ctx, unit);
}

JSValue js_adc_close(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    adc_unit_t unit;
    esp_err_t err;

    (void)this_val;

    if (argc < 1 || js_value_to_adc_unit(ctx, argv[0], &unit) != 0) {
        return JS_ThrowTypeError(ctx, "adc.close(unit) expects adc.UNIT_1 or adc.UNIT_2");
    }

    err = adc_close_unit_state(unit);
    if (err != ESP_OK) {
        return adc_throw_error(ctx, err, "adc.close", unit, -1);
    }
    return JS_NewBool(true);
}

JSValue js_adc_status(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    adc_unit_t unit;

    (void)this_val;

    if (argc < 1 || js_value_to_adc_unit(ctx, argv[0], &unit) != 0) {
        return JS_ThrowTypeError(ctx, "adc.status(unit) expects adc.UNIT_1 or adc.UNIT_2");
    }

    return adc_make_status_object(ctx, unit);
}

JSValue js_adc_configure(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    adc_unit_t unit;
    adc_channel_t channel;
    adc_atten_t atten = ADC_ATTEN_DB_12;
    adc_bitwidth_t bitwidth = ADC_BITWIDTH_DEFAULT;
    adc_oneshot_chan_cfg_t config = {0};
    esp_err_t err;

    (void)this_val;

    if (argc < 3 || js_value_to_adc_unit(ctx, argv[0], &unit) != 0) {
        return JS_ThrowTypeError(ctx, "adc.configure(unit, channel, options) expects adc.UNIT_1 or adc.UNIT_2");
    }
    if (js_value_to_adc_channel(ctx, argv[1], unit, &channel) != 0 || JS_GetClassID(ctx, argv[2]) < 0) {
        return JS_ThrowTypeError(ctx, "adc.configure(unit, channel, options) expects a valid channel and options object");
    }
    if (!adc_require_open(ctx, unit)) {
        return JS_EXCEPTION;
    }

    {
        JSValue property = JS_GetPropertyStr(ctx, argv[2], "atten");
        if (JS_IsException(property)) {
            return JS_EXCEPTION;
        }
        if (!JS_IsUndefined(property) && !JS_IsNull(property) && js_value_to_adc_atten(ctx, property, &atten) != 0) {
            return JS_ThrowTypeError(ctx, "adc.configure({ atten }) expects adc.ATTEN_DB_0/2_5/6/12");
        }

        property = JS_GetPropertyStr(ctx, argv[2], "bitwidth");
        if (JS_IsException(property)) {
            return JS_EXCEPTION;
        }
        if (!JS_IsUndefined(property) && !JS_IsNull(property) && js_value_to_adc_bitwidth(ctx, property, &bitwidth) != 0) {
            return JS_ThrowTypeError(ctx, "adc.configure({ bitwidth }) expects adc.BITWIDTH_DEFAULT or adc.BITWIDTH_9..13");
        }
    }

    config.atten = atten;
    config.bitwidth = bitwidth;

    err = adc_release_cali_handle(adc_channel_state(unit, channel));
    if (err != ESP_OK) {
        return adc_throw_error(ctx,
                               err,
                               "adc.configure calibration cleanup",
                               unit,
                               (int)channel);
    }

    err = adc_oneshot_config_channel(adc_unit_state(unit)->handle, channel, &config);
    if (err != ESP_OK) {
        return adc_throw_error(ctx, err, "adc_oneshot_config_channel", unit, (int)channel);
    }

