99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/adc/esp32_mquickjs_adc.c
    adc_channel_state(unit, channel)->configured = true;
    adc_channel_state(unit, channel)->atten = atten;
    adc_channel_state(unit, channel)->bitwidth = bitwidth;
    adc_create_cali_state(unit, channel, atten, bitwidth);

    return adc_make_status_object(ctx, unit);
}

JSValue js_adc_read(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    adc_unit_t unit;
    adc_channel_t channel;
    int raw = 0;
    esp_err_t err;

    (void)this_val;

    if (argc < 2 || js_value_to_adc_unit(ctx, argv[0], &unit) != 0 || js_value_to_adc_channel(ctx, argv[1], unit, &channel) != 0) {
        return JS_ThrowTypeError(ctx, "adc.read(unit, channel) expects a valid unit/channel pair");
    }
    if (!adc_require_open(ctx, unit) || !adc_require_configured(ctx, unit, channel)) {
        return JS_EXCEPTION;
    }

    err = adc_oneshot_read(adc_unit_state(unit)->handle, channel, &raw);
    if (err != ESP_OK) {
        return adc_throw_error(ctx, err, "adc_oneshot_read", unit, (int)channel);
    }

    return JS_NewInt32(ctx, raw);
}

JSValue js_adc_readMilliVolts(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    adc_unit_t unit;
    adc_channel_t channel;
    int millivolts = 0;
    esp_err_t err;

    (void)this_val;

    if (argc < 2 || js_value_to_adc_unit(ctx, argv[0], &unit) != 0 || js_value_to_adc_channel(ctx, argv[1], unit, &channel) != 0) {
        return JS_ThrowTypeError(ctx, "adc.readMilliVolts(unit, channel) expects a valid unit/channel pair");
    }
    if (!adc_require_open(ctx, unit) || !adc_require_configured(ctx, unit, channel)) {
        return JS_EXCEPTION;
    }
    if (adc_channel_state(unit, channel)->cali_handle == NULL) {
        return JS_ThrowInternalError(ctx,
                                     "adc.readMilliVolts(%d, %d) calibration unavailable for this channel",
                                     adc_unit_to_number(unit),
                                     (int)channel);
    }

    err = adc_oneshot_get_calibrated_result(adc_unit_state(unit)->handle,
                                            adc_channel_state(unit, channel)->cali_handle,
                                            channel,
                                            &millivolts);
    if (err != ESP_OK) {
        return adc_throw_error(ctx, err, "adc_oneshot_get_calibrated_result", unit, (int)channel);
    }

    return JS_NewInt32(ctx, millivolts);
}

JSValue js_adc_ioToChannel(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    int pin = -1;
    adc_unit_t unit;
    adc_channel_t channel;
    esp_err_t err;
    JSGCRef mapping_ref;
    JSValue *mapping_obj;

    (void)this_val;

    if (argc < 1 || JS_ToInt32(ctx, &pin, argv[0]) != 0) {
        return JS_ThrowTypeError(ctx, "adc.ioToChannel(pin) expects a GPIO number");
    }

    err = adc_oneshot_io_to_channel(pin, &unit, &channel);
    if (err != ESP_OK) {
        return JS_NULL;
    }

    mapping_obj = JS_PushGCRef(ctx, &mapping_ref);
    *mapping_obj = JS_NewObject(ctx);
    if (JS_IsException(*mapping_obj)) {
        JS_PopGCRef(ctx, &mapping_ref);
        return JS_EXCEPTION;
    }

    if (!esp32_mquickjs_set_property_ref(ctx, mapping_obj, "unit", JS_NewInt32(ctx, adc_unit_to_number(unit))) ||
        !esp32_mquickjs_set_property_ref(ctx, mapping_obj, "channel", JS_NewInt32(ctx, (int32_t)channel))) {
        JS_PopGCRef(ctx, &mapping_ref);
        return JS_EXCEPTION;
    }

    return JS_PopGCRef(ctx, &mapping_ref);
}

JSValue js_adc_channelToIo(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    adc_unit_t unit;
    adc_channel_t channel;
    int pin = -1;
    esp_err_t err;

    (void)this_val;

    if (argc < 2 || js_value_to_adc_unit(ctx, argv[0], &unit) != 0 || js_value_to_adc_channel(ctx, argv[1], unit, &channel) != 0) {
        return JS_ThrowTypeError(ctx, "adc.channelToIo(unit, channel) expects a valid unit/channel pair");
    }

    err = adc_oneshot_channel_to_io(unit, channel, &pin);
    if (err != ESP_OK) {
        return JS_NULL;
    }

    return JS_NewInt32(ctx, pin);
}

JSValue js_adc_get_unit_count(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_NewInt32(ctx, SOC_ADC_PERIPH_NUM);
}

JSValue js_adc_get_max_channel_count(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_NewInt32(ctx, SOC_ADC_MAX_CHANNEL_NUM);
}

#endif
